//
//  File.swift
//  Memorable
//
//  Created by 김현기 on 6/26/24.
//

import Foundation

// var mockText: String =
//    "삼쩜삼은 이제 직원수가 140명에 달한다. 그러나 이 기업은 아직도 스타트업 회사의 방식을 사용하며, 사람들에겐 생소할 수 있는 운영방식을 사용하고 있다. 바로 얼라인한 운영 방식이다. 대기업과 같이 사원수가 많고 체계가 중요한 기업에서 채택중인 방법은 보통 상하수직관계의 워터폴 형식인데 이와 다른 모습인 것이다. 이 부분은 뒤에서 말할 마케팅 전략과도 관련있는데, 바로 하나의 타겟을 위해서 기업 전반의 체제가 움직여 전략을 수립한다는 것이다. 얼라인한 기업이란 사원들이 팀별로 전체가 동기화되어 성장하는 방식을 사용해 성장한 기업이 된 이 시점에도 처음의 가치관을 잃지 않고 나아갈 수 있게 해준다는것이다.\n삼쩜삼은 ‘고객의 부를 증진하는 것’ 이라는 미션 안에서 4가지 경영이념을 가지고 있다. 첫 번째 경영이념은 일상을 거친 도전으로 채우는 사람들의 집합이다. 이는 그 어떤 고정관념을 가지고 세상을 바라보는 것이 아닌 혁신할 수 있는 기회를 잡고, 그 기회를 가장 중요한 목표로 삼아 성장하는 기업이 되고자 하는 것이다. 열린 마음과 어떤 기회나 상황을 포착했을 때 몰두할 수 있는 기업이 되고자 하는 것이다. 두 번째 경영이념은 연대와 협업의 가치를 아는 사람의 집합이다. 이는 경쟁과 분리보다는 연대, 팀워크를 가지고 모두가 하나의 목적을 가지고 나아갈 때 가장 큰 시너지와 성취가 이뤄질 수 있다고 이야기한다. 이는 얼라인한 기업체제를 가져가는 것과도 깊은 연관성을 가지고 있다. 세 번째 경영이념은 모든 것에 진심인 사람들의 집합이다. 이는 고객을 이해하며, 불편함을 해결하고 사원개인들의 업무효율 고취와 내적 동기를 높이는 부분에 대해서 중요하게 생각하는 회사의 모습을 보여준다. 회사일을 본인의 일과 같이 어떤 순간에서도 최선을 다해 수행하는 사원들이라면 결과물 역시도 최고일것이라는 것을 파악한 회사의 경영이념이라고 볼 수있다. 마지막은 빠르고 심플한 사람들의 집합이다. 두려운 부분에 대해 최선의 노력을 하고 최고의 결과를 얻어온다라는경영이념들에 가장 중요한 부분이라고 생각한다. 어찌보면 가장 어려울 수 있는 의사결정의 과정에서 지엽적이고 닫힌 내용이 아닌 빠르고 과감한 도전을 통해서 동력을 얻어가는 방법을 채택한다는 것이다.\n그리고 이를 기반으로 현재 엄청난 성장세를 기록중인 삼쩜삼의 결과론적인 성공이유는 고객 유치에 있다. 처음 2020년도 출범해서 치열한 마케팅과 서비스 제공에도 불구하고 150만명에 불과했던 서비스는, 현재 2024년도 기준 사용자는 1000만명이 넘는 경제인구의 반 이상이 사용중인 서비스가 되었다. 누적환급액 6132억, 일 평균 환급금의 규모는 9.75% 등 가히 폭풍적인 성장이라 할 수 있는 삼쩜삼은 현재 대한민국의 최고 개인 세금 서비스라고 말해도 손색이 없게 성장했다.\n이렇게까지 성공할 수 있었던 고객유치의 성장세는 삼쩜삼의 독특한 마케팅 전략에 있는데, 이는 연령층에 최적화된 차별화된 마케팅이다. 처음 삼쩜삼에서 타게팅한 세대는 4050세대로, 대한민국의 현재 가장 활발한 경제인구를 타겟팅했다. 마케팅 전략으로는 TV, CF광고를 통한 기업홍보를 진행했다. 홍보의 포인트는 개인의 월급 및 제테크에 대한 부분을 건드리며 성장했다. 이는 경제활동 인구 중 3.54명 중 1명이 사용하는 비율까지 성장했으며, 안정적인 첫 번째 타겟팅에 성공한 것이다.\n두 번째 2030세대, 일용직 아르바이트를 비롯한 모든 경제계층에 대하여 폭 넓게 홍보를 진행했다. 2030세대를 타게팅 할때는 sns의 적극적인 활용을 통해서 접근과 사용의 용이성에 중점을 두었고, 이는 완벽하게 성공해내며 결과를 증명했다. 이 부분에 대해서 자세하게 적고자 한다. “마케팅의 시작은 고객을 이해하는 것” 이라는 가장 기본으로 돌아가서 2030세대의 소비 패턴과 제품 사용 시작의 유입루트를 분석했다. 고객의 언어로 삼쩜삼의 가치를 표현해냈다. “꽁돈, 꽁소고기, 눈먼돈”과 같이 2030세대를 겨냥한 고객의 언어화는 진짜 효용적인 가치임을 증명하게 해주는 것이다\n하지만 이에 대해서 부정적으로 느끼는 세대는 분명히 존재했다. 공짜 돈이라는 의미가 전달되지 않은채 말 그대로 불로소득에 대한 부분만 받아들여져 특정 세대에서의 점유율은 떨어지는 것이다. 이에 대해서 삼쩜삼은 또 한 번 전략구성을 했다. 인구 밀집도가 높은 지역의 TV, 전광판 버스, 택시, 지하철 스크린 도어 등의 빅모델 효과를 노린 것이다. 이는 기본 가입률에서 91%나 증가한 결과를 보여주었다.\n이와 같은 문제에 대한 정확한 정의와 분석을 통한 새로운 마케팅 전략의 수립, 그리고 민첩하고 빠른 시장 침투 등에 대한 부분들을 생각해봤을 때, 삼쩜삼이라는 기업의 A부터 Z의 일을 마케팅팀에서 분담한 부분이 크다는 생각도 들었다. 가장 최근 마케팅 전략으로는 환급금으로 환생한 나의 세금이라는 키워드로 가수 윤종신 씨를 모델로 한 광고를 진행했다. 중독성 있는 카피라이트를 작성하고 만들어 사용자들에게 친숙하고 안정감 있는 부분을 제공하고자 노력했다.\n위에 언급한 바와 같이 삼쩜삼(자비즈앤 빌런즈)이 사용하고 있는 마케팅 전략은 매우 획기적이며 IT벤처기업들의 귀감이 되는 사례가 되었다. 그렇다면 이들이 사용한 상황이 변화해 감에 따라 새로운 전략을 세우고 그 세운 전략들에 대해서 구체적인 방향을 정리하고 저체적인 그림을 짜는 것은 어떻게 이뤄질까? 나는 이를 전략챕터라는 부서의 특수성에서 찾게 되었다.\n전략챕터의 일을 한 줄로 정리 하자면 신사업을 하기 전에 기업 자체적인 메타인지를 통해서 필요한 자원을 파악하는 것이다. 어렵게 표현됐지만 쉽게 생각하면 기업이 의사결정을 할 때 필요한 것, 가지고 있는 것을 확실히 분석하여 조율해서 하나의 선택지를 정할 수 있는 방향성을 제시해 주는 것이다. 마케팅 부서도, 제품팀에서도 보는 시선이 다를 때 이에 대한 하나의 시야를 제공해서 모두가 하나의 목표를 바라볼 수 있게 해주고 이 바라봄의 확실한 이유를 제시하는 것이다.\n제품 전략팀과 위에 정리한 마케팅 팀과의 협업을 통해서 하나의 예시를 들어보고자 한다. 삼쩜삼이 웹으로만 존재하던 당시에 앱으로의 전환을 선택한 순간이 있었다. 이에 대해 부여된 예산만 자그마치 95억, 이 금액은 결정권자라는 전략챕터 3인 팀에 부여된 예산이었으며, 이를 통해서 완성이 가능할지 안될지에 대한 부분을 파악하고 마케팅, 제품 부서와의 협업을 통해서 부족한 지식적인 측면을 배우고 이해하게 된다. 그리고 그렇게 파악한 부서간의 간극을 채우고 하나의 방향성을 제시한다. 앱개발자들과 서버 개발자, 그리고 구축되어 있는 서버와의 클백연결까지 모두 하나의 시스템으로 이어주고 이를 통한 앱 마케팅까지 예산을 정하고 주어진 시간안에 해결하게 해주는 로드맵을 작성해주는 것이다.\n이 삼쩜삼이라는 기업을 처음 알게 됐을 때 그저 개인 세금 환급을 도와주는 서비스! 라고 생각하고 넘어가기에는 시스템적인 부분으로 이미 경쟁우위라는 점이 대단했다. 이제는 내가 깨달은 부분들에 대해서 느낌점을 정리해보고자 한다. 기업이 성장할수록, 다루는 돈의 규모와 사용자 및 산업의 중심 기업이 될수록 그 기업은 혁신보다는 유지보수를 선택할 수 밖에 없다. 그러나 삼쩜삼은 달랐다. 처음 스타트업으로 시작한 기업이 초기 1년만에 무려 800만명이라는 엄청난 사용자수를 얻어냈음에도 불구하고 단 한 순간의 주저함 없이 계속해서 바뀌는 마케팅 전략 및 전체적인 로드맵 수립을 하고 있다. 중장기 목표를 매 분기 짜며, 꺽일 기미 없는 성장세에 맞는 성장에 맞춰진 전략 수립까지 하며 성장에 쉼없는 기업의 모습을 보여주고 있다.\n또한 규모가 큰 회사에서는 사용하기 힘들다고 알고 있는 얼라인한 운영방식을 사용하며 유동적이고 타겟에 최적화된 마케팅 전략을 사용하는 삼쩜삼은 너무 대단해보이는 기업으로 보여진다. 빠른 문제정의와 이를 활용한 한 발 빠른 솔루션의 수립은 이 스타트업으로 시작한 중견기업의 정체가 아닐까 생각한다. 추가할 수 있는 모든 경우의 수적인 세금 과세에 대한 서비스를 사용자들에게 제공하고 이를 기반으로 현재는 해외 진출을 준비하고 있다. 동남아시아 시장 진출시도에서 실패하고, 현재 영국을 첫 번쨰 해외 진출 국가로 선정했는데, 성공적인 진출을 통해 해외 진출 기업까지의 성장이 됐으면 바라는 삼쩜삼이라는 기업인 것 같다."
// var mockAnswers: [String] =
//    ["삼쩜삼", "기업", "기업", "기업", "마케팅", "전략", "기업", "전략", "기업", "기업", "삼쩜삼", "경영이념", "경영이념", "도전", "혁신", "기업", "기업", "경영이념", "연대", "연대", "기업", "경영이념", "경영이념", "경영이념", "도전", "성장세", "삼쩜삼", "유치", "마케팅", "서비스", "서비스", "사용자", "경제인구", "서비스", "삼쩜삼", "세금", "서비스", "고객유치", "성장세", "삼쩜삼", "마케팅", "전략", "마케팅", "삼쩜삼", "경제인구", "마케팅", "전략", "광고", "기업", "마케팅", "삼쩜삼", "삼쩜삼", "전략", "마케팅", "전략", "삼쩜삼", "기업", "마케팅", "마케팅", "전략", "세금", "광고", "사용자", "안정감", "삼쩜삼", "빌런즈", "마케팅", "전략", "기업", "전략", "전략", "전략", "전략", "기업", "기업", "마케팅", "전략", "마케팅", "삼쩜삼", "전략", "마케팅", "마케팅", "삼쩜삼", "기업", "세금", "서비스", "기업", "사용자", "기업", "기업", "혁신", "삼쩜삼", "기업", "사용자", "마케팅", "전략", "성장세", "전략", "기업", "마케팅", "전략", "삼쩜삼", "기업", "기업", "세금", "서비스", "사용자", "기업", "삼쩜삼", "기업"]

var mockText: String = "먼저 무지한 스승의 저자인 자크 랑시에르의 철학적 배경의 시작부터 소개하고자 한다. 랑시에르는 프랑스의 마르크스주의 철학자인 알튀세르의 제자로서 구조주의와 포스트구조주의적 철학에 큰 영향을 받은 철학자였다. 그렇기에 랑시에르의 철학은 프랑스의 사회구조의 영향과 알튀세르의 영향을 받아 권력, 평등, 해방에 초점을 맞추어 전개된다. 이는 책 기저에 깔려 있는 평등한 지적 능력을 비롯한 평등한 교육의 권리 등에 대한 철학적 배경을 제공한다. \n 그리고 조제프 자코토의 교육 실험과 역사적인 맥락을 짚고 넘어가고자 한다. 조세프 자코토는 프랑스의 교육자였으며, 교육을 전담했던 시기는 프랑스 혁명 이후였다. 이 시기는 사회의 모든 구조가 변혁을 맞이하던 당시였으며, 새로운 교육방법이 제시되어 기반 자체에 대한 새로운 도전들이 늘어나던 시기였다. 자코토의 교육 실험은 이러한 시기 속에서 벨기에에서 프랑스어를 가르치는 수업을 진행하면서 발생했는데, 네덜란드어를 전혀 모르는 자코토가 프랑스어를 전혀 모르는 학생들에게 가르침을 주는 경험 속에서 시작됐다. \n 위 교육 실험이 주장하는 주요 개념에 대해서 랑시에르는 모든 인간이 본질적으로 동일한 지적 능력을 가지고 있다. 라고 주장한다. 이에 대해서 비판적으로 바라본 부분은 바로 교육시스템에 있다. 어떠한 특정 교육 시스템이 학생들로 하여금 무지를 교육하며, 지적능력에 제한을 가하고 있다는 것이다. 이를 전통적인 교육 시스템이라고 특정하였고, 이에 대한 새로운 교육 시스템의 등장 및 교육 시스템의 변혁을 중심으로 논지를 전개한다. \n 모국어의 경우 아이들에게 가르치지 않아도 어느 순간 이들의 일상속에 녹아 배움이 일어난다. 그리고 평등한 지적능력의 영역에서 누군가는 기호와 말을 만들기도 하고, 누군가는 기계를 만드는 지능까지의 분화가 일어나는 것이다. 이것은 가르치는 사람에 대한 부분의 영역이 아니다 그저 해방까지의 길을 제시하고 끌어내 줄 수 있는 사람의 존재가 중요한 것이다. 그리고 우리는 이를 무지한 스승이라고 일컫게 되는것이다. "

var mockAnswers: [String] = ["무지한 스승", "자크 랑시에르", "프랑스", "마르크스주의", "알튀세르", "구조주의", "포스트구조주의", "권력", "평등", "해방", "평등", "지적 능력", "평등한 교육", "조제프 자코토", "프랑스 혁명", "벨기에", "프랑스어", "네덜란드어", "교육 실험", "지적 능력", "교육 시스템", "전통적인 교육", "모국어", "기호", "해방", "무지한 스승"]

var mockAnswers2: [String] = ["스승", "자크", "랑시에르", "랑시에르", "프랑스", "마르크스주의", "알튀세르", "구조주의", "구조주의", "랑시에르", "프랑스", "알튀세르", "권력", "평등", "해방", "평등", "평등", "교육", "조제프", "자코토", "교육", "자코토", "프랑스", "교육", "교육", "프랑스", "혁명", "교육", "자코토", "교육", "벨기에", "프랑스", "네덜란드어", "자코토", "프랑스", "학생", "교육", "랑시에르", "교육", "교육", "학생", "교육", "지적능력", "교육", "교육", "교육", "모국어", "평등", "지적능력", "기계", "해방", "스승"]

var mockWrongQuestions: [String] = [
    "어떤 특정한 행동을 기대하는 것을 무엇이라고 하나요?",
    "공통의 가치관을 가진 사람들이 교류하는 집합체를 무엇이라고 하나요?",
    "정기적으로 상호작용하지만 사회조직에 속해있지 않은 간단한 집합체를 무엇이라고 하나요?",
    "공통의 특성을 가진 사람들의 집합체는 무엇인가요?",
    "집단에 속하는 구성원들이 공유하는 정체성을 무엇이라고 하나요?",
    "어떤 특정한 행동을 기대하는 것을 무엇이라고 하나요?",
    "공통의 가치관을 가진 사람들이 교류하는 집합체를 무엇이라고 하나요?",
    "정기적으로 상호작용하지만 사회조직에 속해있지 않은 간단한 집합체를 무엇이라고 하나요?",
    "공통의 특성을 가진 사람들의 집합체는 무엇인가요?",
    "집단에 속하는 구성원들이 공유하는 정체성을 무엇이라고 하나요?",
    "어떤 특정한 행동을 기대하는 것을 무엇이라고 하나요?",
    "공통의 가치관을 가진 사람들이 교류하는 집합체를 무엇이라고 하나요?",
    "정기적으로 상호작용하지만 사회조직에 속해있지 않은 간단한 집합체를 무엇이라고 하나요?",
    "공통의 특성을 가진 사람들의 집합체는 무엇인가요?",
    "집단에 속하는 구성원들이 공유하는 정체성을 무엇이라고 하나요?",
    "어떤 특정한 행동을 기대하는 것을 무엇이라고 하나요?",
    "공통의 가치관을 가진 사람들이 교류하는 집합체를 무엇이라고 하나요?",
    "정기적으로 상호작용하지만 사회조직에 속해있지 않은 간단한 집합체를 무엇이라고 하나요?",
    "공통의 특성을 가진 사람들의 집합체는 무엇인가요?",
    "집단에 속하는 구성원들이 공유하는 정체성을 무엇이라고 하나요?",
]

var mockWrongQuestionAnswers: [String] = [
    "기대치",
    "Social group",
    "Aggregate",
    "Social category",
    "정체성",
    "기대치",
    "Social group",
    "Aggregate",
    "Social category",
    "정체성",
    "기대치",
    "Social group",
    "Aggregate",
    "Social category",
    "정체성",
    "기대치",
    "Social group",
    "Aggregate",
    "Social category",
    "정체성",
]
